[{"tag":"h1","inner":"Visión general"},{"tag":"md","inner":"React Query a menudo se describe como la biblioteca de búsqueda de datos que falta para React, pero en términos más técnicos, hace que **buscar, almacenar en caché, sincronizar y actualizar el estado del servidor** en sus aplicaciones de React sea muy fácil."},{"tag":"h2","inner":"Motivación"},{"tag":"md","inner":"Fuera de la caja, las aplicaciones de React **no** vienen con una forma obstinada de obtener o actualizar datos de sus componentes, por lo que los desarrolladores terminan construyendo sus propias formas de obtener datos. Esto generalmente significa improvisar el estado y el efecto basados en componentes utilizando ganchos de React, o usar bibliotecas de administración de estado de propósito más general para almacenar y proporcionar datos asíncronos en todas sus aplicaciones."},{"tag":"md","inner":"Aunque la mayoría de las bibliotecas de administración de estado tradicionales son excelentes para trabajar con el estado del cliente, **no son tan buenas para trabajar con el estado asincrónico o del servidor**. Esto se debe a que **el estado del servidor es totalmente diferente**. Para empezar, estado del servidor:"},{"tag":"md","inner":"- Se conserva de forma remota en una ubicación que no controla ni es de su propiedad\n- Requiere API asincrónicas para obtener y actualizar\n- Implica propiedad compartida y puede ser cambiado por otras personas sin su conocimiento\n- Puede potencialmente volverse \"desactualizado\" en sus aplicaciones si no tiene cuidado\n"},{"tag":"md","inner":"- Caché... (posiblemente lo más difícil de hacer en programación)\n- Duplicación de varias solicitudes para los mismos datos en una sola solicitud\n- Actualización de datos \"desactualizados\" en segundo plano\n- Saber cuándo los datos están \"desactualizados\"\n- Reflejar las actualizaciones de los datos lo más rápido posible\n- Optimizaciones de rendimiento como paginación y carga diferida de datos\n- Administración de la memoria y la recolección de elementos no utilizados del estado del servidor\n- Memorización de los resultados de la consulta con el uso compartido estructural\n"},{"tag":"md","inner":"Si no está abrumado por esa lista, entonces eso debe significar que probablemente ya haya resuelto todos los problemas de estado de su servidor y merezca un premio. Sin embargo, si usted es como la gran mayoría de las personas, aún tiene que abordar todos o la mayoría de estos desafíos y ¡solo estamos arañando la superficie!"},{"tag":"md","inner":"En una nota más técnica, React Query probablemente podrá:\n\n- Le ayuda a eliminar **muchas** líneas de código complicado y mal entendido de su aplicación y reemplazarlo con solo un puñado de líneas de lógica de React Query.\n- Haga que su aplicación sea más fácil de mantener y más fácil de crear nuevas características sin preocuparse por cablear nuevos orígenes de datos de estado del servidor\n- Tenga un impacto directo en sus usuarios finales haciendo que su aplicación se sienta más rápida y con mayor capacidad de respuesta que nunca.\n- Potencialmente le ayudará a ahorrar ancho de banda y aumentar el rendimiento de la memoria\n"},{"tag":"h2","inner":"¡Basta de hablar, muéstrame un poco de código ya!"},{"tag":"p","inner":"En el siguiente ejemplo, puede ver React Query en su forma más básica y simple que se utiliza para obtener las estadísticas de GitHub para el proyecto GitHub de React Query en sí:"},{"tag":"javascript","inner":"/* eslint-disable jsx-a11y/anchor-is-valid */\nimport React from \"react\";\nimport ReactDOM from \"react-dom\";\nimport { QueryClient, QueryClientProvider, useQuery } from \"react-query\";\nimport { ReactQueryDevtools } from \"react-query/devtools\";\nimport axios from \"axios\";\n\nconst queryClient = new QueryClient();\n\nexport default function App() {\n  return (\n    <QueryClientProvider client={queryClient}>\n      <Example />\n    </QueryClientProvider>\n  );\n}\n\nfunction Example() {\n  const { isLoading, error, data, isFetching } = useQuery(\"repoData\", () =>\n    axios.get(\n      \"https://api.github.com/repos/tannerlinsley/react-query\"\n    ).then((res) => res.data)\n  );\n\n  if (isLoading) return \"Loading...\";\n\n  if (error) return \"An error has occurred: \" + error.message;\n\n  return (\n    <div>\n      <h1>{data.name}</h1>\n      <p>{data.description}</p>\n      <strong>👀 {data.subscribers_count}</strong>{\" \"}\n      <strong>✨ {data.stargazers_count}</strong>{\" \"}\n      <strong>🍴 {data.forks_count}</strong>\n      <div>{isFetching ? \"Updating...\" : \"\"}</div>\n      <ReactQueryDevtools initialIsOpen />\n    </div>\n  );\n}\n\nconst rootElement = document.getElementById(\"root\");\nReactDOM.render(<App />, rootElement);\n","lineNumber":"1"},{"tag":"p","inner":"Como puedes ver se trata de una libreria que se instala a nivel global.","lineNumber":"1"},{"tag":"javascript","inner":"import { QueryClient, QueryClientProvider, useQuery } from \"react-query\";\nimport { ReactQueryDevtools } from \"react-query/devtools\";","lineNumber":"4"},{"tag":"javascript","inner":"const queryClient = new QueryClient();\n\nexport default function App() {\n  return (\n    <QueryClientProvider client={queryClient}>\n      <Example />\n    </QueryClientProvider>\n  );\n}","lineNumber":"10"},{"tag":"md","inner":"Que permite generar 4 variables relacionadas al estado de una api con una sola instruccion. **useQuery**","lineNumber":"1"},{"tag":"javascript","inner":"const { isLoading, error, data, isFetching } = useQuery(\"repoData\", () =>\n","lineNumber":"19"}]