[{"tag":"h1","inner":"Datos de consulta de marcador de posición"},{"tag":"h2","inner":"¿Qué son los datos de marcador de posición?"},{"tag":"md","inner":"Los datos de marcador de posición permiten que una consulta se comporte como si ya tuviera datos, de forma similar a la opción, pero **los datos no se conservan en la memoria caché.** Esto es útil para situaciones en las que tiene suficientes datos parciales (o falsos) para representar la consulta correctamente mientras los datos reales se obtienen en segundo plano. (initialData)"},{"tag":"md","inner":"**Ejemplo:** Una consulta de entrada de blog individual podría extraer datos de \"vista previa\" de una lista principal de entradas de blog que solo incluyen el título y un pequeño fragmento del cuerpo de la publicación. No querrá conservar estos datos parciales en el resultado de la consulta de la consulta individual, pero es útil para mostrar el diseño de contenido lo más rápido posible mientras la consulta real finaliza para obtener todo el objeto."},{"tag":"md","inner":"Hay varias maneras de proporcionar datos de marcador de posición para una consulta a la memoria caché antes de que la necesite:"},{"tag":"md","inner":"- Declarativamente:\n - Proporcionar a una consulta para rellenar previamente su caché si está vacía placeholderData\n- Imperativamente:\n - Prefetch or fetch the data using  queryClient y la opción placeholderData"},{"tag":"h2","inner":"Datos de marcador de posición como valor"},{"tag":"gdscript","inner":"1 function Todos() {\n2  const result = useQuery('todos', () => fetch('/todos'), {\n3    placeholderData: placeholderTodos,\n4  })\n5 }"},{"tag":"h2","inner":"Datos de marcador de posición como función"},{"tag":"p","inner":"Si el proceso para acceder a los datos de marcador de posición de una consulta es intensivo o simplemente no es algo que desee realizar en cada representación, puede memorizar el valor o pasar una función memorizada como valor: (placeholderData)"},{"tag":"gdscript","inner":"1 function Todos() {\n2  const placeholderData = useMemo(() => generateFakeTodos(), [])\n3  const result = useQuery('todos', () => fetch('/todos'), { placeholderData })\n4 }\n"},{"tag":"h2","inner":"Datos de marcador de posición de la caché"},{"tag":"p","inner":"En algunas circunstancias, es posible que pueda proporcionar los datos de marcador de posición para una consulta del resultado almacenado en caché de otra. Un buen ejemplo de esto sería buscar los datos almacenados en caché de una consulta de lista de entradas de blog para obtener una versión preliminar de la publicación, luego usarla como datos de marcador de posición para su consulta de publicación individual:"},{"tag":"gdscript","inner":"1 function Todo({ blogPostId }) {\n2  const result = useQuery(['blogPost', blogPostId], () => fetch(`/blogPosts/${blogPostId}`), {\n3    placeholderData: () => {\n4      // Use the smaller/preview version of the blogPost from the 'blogPosts' query as the placeholder data for this blogPost query\n5      return queryClient\n6        .getQueryData('blogPosts')\n7        ?.find(d => d.id === blogPostId)\n8    },\n9  })\n10 }\n"},{"tag":"h2","inner":"Lecturas adicionales"},{"tag":"p","inner":"Para una comparación entre y , eche un vistazo a los Recursos de la comunidad. (Placeholder Data , Initial Data)"}]