[{"tag":"h1","inner":"Ejemplos de almacenamiento en caché"},{"tag":"p","inner":"Lea detenidamente los valores predeterminados importantes antes de leer esta guía"},{"tag":"h2","inner":"Ejemplo básico"},{"tag":"p","inner":"Este ejemplo de almacenamiento en caché ilustra la historia y el ciclo de vida de:\n"},{"tag":"md","inner":"- Instancias de consulta con y sin datos de caché\n- Recuperación en segundo plano\n- Consultas inactivas\n- Recolección\n"},{"tag":"p","inner":"Supongamos que estamos usando el valor predeterminado de 5 minutos y el valor predeterminado de . cacheTime , staleTime , 0"},{"tag":"md","inner":"- Una nueva instancia de montajes. useQuery('todos', fetchTodos)\n- Dado que no se han realizado otras consultas con esta combinación de consulta + variable, esta consulta mostrará un estado de carga dura y realizará una solicitud de red para obtener los datos.\n- A continuación, almacenará en caché los datos utilizando y como identificadores únicos para esa memoria caché. 'todos' , fetchTodos\n- El gancho se marcará como obsoleto después de la configuración (el valor predeterminado es , o inmediatamente). staleTime , 0\n- Una segunda instancia de montajes en otro lugar. useQuery('todos', fetchTodos)\n- Dado que estos datos exactos existen en la memoria caché desde la primera instancia de esta consulta, esos datos se devuelven inmediatamente desde la memoria caché.\n- Se activa una recuperación en segundo plano para ambas consultas (pero solo una solicitud), ya que apareció una nueva instancia en la pantalla.\n- Ambas instancias se actualizan con los nuevos datos si la recuperación se realiza correctamente\n- Ambas instancias de la consulta están desmontadas y ya no están en uso. useQuery('todos', fetchTodos)\n- Dado que no hay más instancias activas de esta consulta, se establece un tiempo de espera de caché para eliminar y recopilar la consulta (el valor predeterminado es 5 minutos). cacheTime\n- Antes de que se agote el tiempo de espera de la memoria caché se haya completado otra instancia de montajes. La consulta devuelve inmediatamente el valor almacenado en caché disponible mientras la función se ejecuta en segundo plano para rellenar la consulta con un valor nuevo. useQuery('todos', fetchTodos), fetchTodos\n- La instancia final de desmonta. useQuery('todos', fetchTodos)\n- No aparecen más instancias en 5 minutos. useQuery('todos', fetchTodos)\n- Esta consulta y sus datos se eliminan y se recopilan elementos no utilizados.\n"}]