[{"tag":"h1","inner":"Customizar - Stale Time"},{"tag":"p","inner":"Ahora, como pueden ver, el juego es bastante agresivo en cuanto a este tema de la caché. "},{"tag":"p","inner":"Nada más que ustedes traen los datos del servidor ya los considera que pueden estar desactualizados de forma automática y los mueve hacia \"state\", pero eso se podría modificar un poco. "},{"tag":"p","inner":"Si aquí agarramos y cambiamos el \"state time\", que por defecto está en cero, podríamos ponerle, por ejemplo, 60000 que sería un minuto. "},{"tag":"javascript","inner":"  const {\n    data: posts,\n    error,\n    isLoading,\n    isFetching\n  } = useQuery([\"posts\", getPosts, {\n    staleTime: 60000 //una hora\n  }])"},{"tag":"p","inner":"Entonces, veamos que si ahora nos movemos hacia esa página y volvemos hacia esta página, no se hace ningún \"refetching\". Esto es porque los datos están frescos. Como podemos ver aquí, él siempre va a tratar de traer los datos. Los datos se consideran frescos por el tiempo que esté configurado el \"state time\". Si no le configuramos nada, por defecto es 0 milisegundos y automáticamente se mueven a \"stale\"."},{"tag":"p","inner":"\nPero si quisiéramos configurarlo en state time, entonces los tendríamos en cache considerados frescos por más tiempo y no se darían tantos fallos en background y no afectaríamos tanto nuestra API. \n"},{"tag":"p","inner":"Lo otro que también se puede hacer es, si ustedes quieren que los datos siempre que estén en la caché se consideren frescos y no se haga ningún tipo de refetching de estos, entonces lo que pueden hacer es ponerle infinity en el state."},{"tag":"javascript","inner":"  const {\n    data: posts,\n    error,\n    isLoading,\n    isFetching\n  } = useQuery([\"posts\", getPosts, {\n    staleTime: Infinity \n  }])"},{"tag":"p","inner":"De esta manera nunca se considerarán viejos y siempre se mantendrán frescos. Esto sería útil para algún tipo de evento en el que los datos que ustedes traigan sean como un juego mutable que nunca cambie. Siempre lo vamos a tener en la calle de forma fresca.\n"}]