[{"tag":"h1","inner":"Devtools"},{"tag":"p","inner":"¡Agita tus manos en el aire y grita hurra porque React Query viene con herramientas de desarrollo dedicadas! 🥳\n"},{"tag":"p","inner":"\nCuando comience su viaje de React Query, querrá estas herramientas de desarrollo a su lado. ¡Ayudan a visualizar todo el funcionamiento interno de React Query y probablemente le ahorrarán horas de depuración si se encuentra en apuros!"},{"tag":"p","inner":"\nTenga en cuenta que, por ahora, las devtools no son compatibles con React Native. Si desea ayudarnos a hacer que la plataforma devtools sea agnóstica, ¡háganoslo saber!"},{"tag":"h1","inner":"Importar las devtools"},{"tag":"p","inner":"Las devtools se dividen en el paquete. No es necesario instalar nada extra, simplemente: (react-query/devtools)"},{"tag":"html","inner":"import { ReactQueryDevtools } from 'react-query/devtools'"},{"tag":"md","inner":"De forma predeterminada, las React Query Devtools solo se incluyen en los paquetes cuando , por lo que no necesita preocuparse por excluirlos durante una compilación de producción. (process.env.NODE_ENV === 'development')\n"},{"tag":"h1","inner":"Modo flotante"},{"tag":"md","inner":"El modo flotante montará las devtools como un elemento fijo y flotante en tu aplicación y proporcionará un interruptor en la esquina de la pantalla para mostrar y ocultar las devtools. Este estado de alternancia se almacenará y recordará en localStorage en todas las recargas.\n\nColoque el siguiente código lo más alto posible en su aplicación React. ¡Cuanto más cerca esté de la raíz de la página, mejor funcionará!\n"},{"tag":"html","inner":" import { ReactQueryDevtools } from 'react-query/devtools'\n \n function App() {\n   return (\n     <QueryClientProvider client={queryClient}>\n       {/* The rest of your application */}\n       <ReactQueryDevtools initialIsOpen={false} />\n     </QueryClientProvider>\n   )\n}"},{"tag":"md","inner":"Opciones\n\n- (initialIsOpen: Boolean)\n\nEstablezca esta opción si desea que las herramientas de desarrollo se abran de forma predeterminada (true)\n\n- (panelProps: PropsObject)\n\nUse esto para agregar accesorios al panel. Por ejemplo, puede agregar , (combinar y anular el estilo predeterminado), etc. (className , style)\n\n- (closeButtonProps: PropsObject)\n\nUse esto para agregar accesorios al botón de cierre. Por ejemplo, puede agregar , (combinar y anular el estilo predeterminado), (extender el controlador predeterminado), etc. (className , style , onClick)\n\n- (toggleButtonProps: PropsObject)\n\nUse esto para agregar accesorios al botón de alternancia. Por ejemplo, puede agregar , (combinar y anular el estilo predeterminado), (extender el controlador predeterminado), etc. (className , style , onClick)\n\n- (position?: \"top-left\" | \"top-right\" | \"bottom-left\" | \"bottom-right\")\n\nEl valor predeterminado es bottom-left\n\nLa posición del logotipo de React Query para abrir y cerrar el panel devtools\n"},{"tag":"h1","inner":"El modo integrado "},{"tag":"p","inner":"El modo integrado incrustará las devtools como un componente normal en su aplicación. ¡Puedes darle el estilo que quieras después de eso!"},{"tag":"html","inner":"import { ReactQueryDevtoolsPanel } from 'react-query/devtools'\n \n function App() {\n   return (\n     <QueryClientProvider client={queryClient}>\n       {/* The rest of your application */}\n       <ReactQueryDevtoolsPanel style={styles} className={className} />\n     </QueryClientProvider>\n   )\n}"},{"tag":"h1","inner":"Opciones"},{"tag":"md","inner":"Use estas opciones para aplicar estilo a las herramientas de desarrollo.\n\n- (style: StyleObject)\n\nEl objeto de estilo React estándar utilizado para aplicar estilo a un componente con estilos en línea\n\n- (className: string)\n\nLa propiedad estándar React className utilizada para aplicar estilo a un componente con clases\n"}]