[{"tag":"h1","inner":"Comparación | React Query vs SWR vs Apollo vs RTK Query vs React Router"},{"tag":"md","inner":"Esta tabla de comparación se esfuerza por ser lo más precisa e imparcial posible. Si usa alguna de estas bibliotecas y cree que la información podría mejorarse, no dude en sugerir cambios (con notas o evidencia de reclamos) usando el enlace \"Editar esta página en Github\" en la parte inferior de esta página.\n\nTecla de característica/capacidad:\n\n- ✅ 1ª clase, integrado y listo para usar sin configuración o código agregado\n- 🟡 Compatible, pero como una 3ª parte no oficial o biblioteca / contribución comunitaria\n- 🔶 Compatible y documentado, pero requiere código de usuario adicional para implementarse\n- 🛑 No está oficialmente respaldado o documentado.\n"},{"tag":"md","inner":"VER LO DE IMAGENES / TABLA\n\n"},{"tag":"h1","inner":"Notas"},{"tag":"md","inner":"**1 Datos de consulta retrasados** - React Query proporciona una forma de continuar viendo los datos de una consulta existente mientras se carga la siguiente consulta (similar a la misma UX que el suspenso pronto proporcionará de forma nativa). Esto es extremadamente importante cuando se escriben interfaces de usuario de paginación o interfaces de usuario de carga infinita en las que no desea mostrar un estado de carga completa cada vez que se solicita una nueva consulta. Otras bibliotecas no tienen esta capacidad y representan un estado de carga dura para la nueva consulta (a menos que se haya cargado previamente), mientras se carga la nueva consulta.\n\n**2 Optimización de renderizado** - React Query tiene un excelente rendimiento de renderizado. Solo volverá a representar los componentes cuando se actualice una consulta. Por ejemplo, porque tiene nuevos datos, o para indicar que está buscando. React Query también agrupa las actualizaciones por lotes para asegurarse de que su aplicación solo se vuelva a representar una vez cuando varios componentes estén usando la misma consulta. Si sólo le interesan las propiedades o, puede reducir aún más el número de renderizaciones estableciendo en . Se establece para realizar un seguimiento automático de los campos a los que se accede y solo volver a renderizarlos si uno de ellos cambia. data , error , notifyOnChangeProps , ['data', 'error'] , notifyOnChangeProps: 'tracked'\n\n**3 Coincidencia parcial de consultas** - Debido a que React Query utiliza la serialización de claves de consulta deterministas, esto le permite manipular grupos variables de consultas sin tener que conocer cada clave de consulta individual que desea coincidir, por ejemplo. Puede recuperar todas las consultas que comienzan con en su clave, independientemente de las variables, o puede dirigirse a consultas específicas con (o sin) variables o propiedades anidadas, e incluso usar una función de filtro para que solo coincida con las consultas que superan sus condiciones específicas. todos\n\n**4 Configuración de consulta previa al uso** - Este es simplemente un nombre elegante para poder configurar cómo se comportarán las consultas y las mutaciones antes de ser utilizadas. Por ejemplo, una consulta se puede configurar completamente con valores predeterminados de antemano y cuando llegue el momento de usarla, solo es necesario, en lugar de ser requerido para pasar el fetcher y / o las opciones con cada uso. SWR tiene una forma parcial de esta característica al permitirle preconfigurar un fetcher predeterminado, pero solo como un fetcher global, no por consulta y definitivamente no para mutaciones. useQuery(key)\n\n**5 Recuperación automática después de la mutación** - Para que ocurra una recuperación verdaderamente automática después de que ocurra una mutación, es necesario un esquema (como el que proporciona graphQL) junto con heurísticas que ayuden a la biblioteca a saber cómo identificar entidades individuales y tipos de entidades en ese esquema.\n\n**6 Almacenamiento en caché normalizado** - React Query, SWR y RTK-Query actualmente no admiten el almacenamiento en caché normalizado automáticamente que describe el almacenamiento de entidades en una arquitectura plana para evitar cierta duplicación de datos de alto nivel.\n\n**7 Modo inmutable de SWR** - SWR se envía con un modo \"inmutable\" que le permite obtener una consulta solo una vez durante la vida útil de la memoria caché, pero aún no tiene el concepto de tiempo obsoleto o revalidación automática condicional\n\n**8 Persistencia de caché de React Router** - React Router no almacena en caché los datos más allá de las rutas actualmente coincidentes. Si se deja una ruta, sus datos se pierden.\n\n"},{"tag":"md","inner":""}]